// RefStrings.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include "Str.h"
using namespace std;

int main()
{
    Str str("Helloy");
    str += " world!";
    str[0] = 'h';
    cout << str << endl;
    cout << str[1] << endl;

    Str str1("Hello, World!");
    Str str2 = str1;

    // Изменяем символ в одной копии
    str1[7] = 'G';

    // Выводим обе строки
    cout << "str1: " << str1 << endl;
    cout << "str2: " << str2 << endl;

    // Заменяем несколько символов в одной строке
    str1[1] = 'A';
    str1[3] = 'B';

    // Выводим обе строки
    cout << "str1: " << str1 << endl;
    cout << "str2: " << str2 << endl;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
