// LifeTime.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include "Child.h"
//#include "Aggregate.h"
//#include "Test.h"
#include "AggregateT.h"

using namespace std;

int Test::nCount = 0;
void foo(const Test& t) {
    std::cout << "foo is running" << std::endl;
}

int main()
{
    //cout << "Hello World!\n";
    //Test testObj;
    //Test* p = new Test;
    //delete p;

    //Test* arr = new Test[5];
    //delete[] arr;

    //Test t1;
    //Test t2 = t1; // вызов конструктора копирования
    //foo(t1);

    //Child child;

    //Aggregate objAgg;

    AggregateT<Test> testAggregate;
    AggregateT<Child> childAggregate;

    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
