// arrays.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

void rotate(int a[], int n, bool clockwise = false) {
    if (clockwise) 
    {
        int x = a[n - 1];
        for (int* p = a + n - 1; p > a; p--)
            *p = *(p - 1);
        a[0] = x;
    }
    else {
        int x = a[0];
        for (int* p = a + 1; p - a < n; p++)
            *(p - 1) = *p;
        a[n - 1] = x;
    }
}

int main()
{
    int a[5]{ 1,2,3,4,5 };
    for (int i = 0; i < 5; i++)
        cout << a[i] << " ";
    cout << endl;

    for (int* p = a; p - a < 5; p++)
        cout << *p << ' ';
    cout << endl;

    bool clockwise;
    cout << "enter 0 or 1" << endl;
    cin >> clockwise;
    rotate(a,5, clockwise);
    for (int* p = a; p - a < 5; p++)
        cout << *p << ' ';
    cout << endl;
  

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
